Revit 2016 API
CurveElement Class
Represents a curve element in Autodesk Revit. This could be a Model Line,Detail Line, or other specialty curve such as a Room Boundary Line.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public class CurveElement : Element
Visual Basic
Public Class CurveElement _
	Inherits Element
Visual C++
public ref class CurveElement : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.CurveElement
 Autodesk.Revit.DB.CurveByPoints
 Autodesk.Revit.DB.DetailCurve
 Autodesk.Revit.DB.ModelCurve
 Autodesk.Revit.DB.Structure.AreaReinforcementCurve
 Autodesk.Revit.DB.SymbolicCurve
See Also
CurveElement Members
Autodesk.Revit.DB Namespace